INSERT INTO faculty (faculty_name) VALUES
	('Институт инженерии и машиностроения'),
	('Институт инженеров строительства и транспорта'),
	('Институт архитектуры и дизайна'),
	('Заочный факультет'),
	('Институт цифровых систем'),
	('Институт химии и химической технологии');

INSERT INTO groups (group_name, course, faculty) VALUES
	('МВ-10', '1', '1'),
	('ММ-11', '1', '1'),
	('МТ-15', '1', '1');

INSERT INTO classroom(classroom_name) VALUES
	('А-101'),
	('А-102'),
	('А-103'),
	('А-104'),
	('А-105'),
	('А-106'),
	('А-107'),
	('А-108'),
	('А-109'),
	('А-110'),
	('А-111'),
	('А-112'),
	('А-113'),
	('А-114'),
	('А-115'),
	('А-116'),
	('А-117'),
	('А-118'),
	('А-119');

INSERT INTO subject(subject_name) VALUES
	('Высшая математика'),
	('Начертательная геометрия'),
	('Инженерная графика'),
	('Физика'),
	('Сопротивление материалов');

INSERT INTO lecturer(surname, name, middle_name) VALUES
	('Иванов', 'Иван', 'Иваныч'),
	('Иванов', 'Иван', 'Петрович'),
	('Петрв', 'Игорек', ''),
	('Петрова', 'Ирина', 'Ивановна'),
	('Сидорова', 'Лукерья', 'Тимофеевна'),
	('цуаца', 'цаца', 'муму'),
	('апапмупа', 'а3цпамун', 'упупныч'),
	('Ивцацац', 'Иааца', 'Ивца');
