INSERT INTO classroom(classroom_name) VALUES
	('А-101'), ('А-102'), ('А-103'), ('А-104'),	('А-105'), ('А-106'), ('А-107'), ('А-108'),	('А-109'), ('А-110'),
	('А-111'), ('А-112'), ('А-113'), ('А-114'),	('А-115'), ('А-116'), ('А-117'), ('А-118'),	('А-119'), ('А-120'),
	('Г-501'), ('Г-502'), ('Г-503'), ('Г-504'),	('Г-505'), ('Г-506'), ('Г-507'), ('Г-508'),	('Г-509'), ('Г-510'),
	('Г-611'), ('Г-612'), ('Г-613'), ('Г-614'),	('Г-615'), ('Г-616'), ('Г-617'), ('Г-618'),	('Г-619'), ('Г-620');

INSERT INTO faculty (faculty_name) VALUES
	('Институт инженерии и машиностроения'),
	('Институт инженеров строительства и транспорта'),
	('Институт архитектуры и дизайна'),
	('Заочный факультет'),
	('Институт цифровых систем'),
	('Институт химии и химической технологии');

INSERT INTO groups (group_name, course, faculty) VALUES
	('АД-11', '1', '1'), ('АДСМ-16', '1', '1'), ('АДСМ-17', '1', '1'), ('МТ-15', '1', '1'), ('ММ-11', '1', '1'), ('МВ-10', '1', '1'), ('ЭСМ-12', '1', '1'),
	('АД-21', '2', '1'), ('АДСМ-26', '2', '1'), ('АДСМ-27', '2', '1'), ('МТ-25', '2', '1'), ('ММ-21', '2', '1'), ('МВ-20', '2', '1'), ('ЭСМ-22', '2', '1'),
	('АД-31', '3', '1'), ('АДСМ-36', '3', '1'), ('АДСМ-37', '3', '1'), ('МТ-35', '3', '1'), ('ММ-31', '3', '1'), ('МВ-30', '3', '1'), ('ЭСМ-32', '3', '1'),
	('ЗМ-12', '1', '4'), ('ЗМСП-12', '1', '4'), ('ЗТМ-12', '1', '4'), ('ЗА-14', '1', '4'), ('ЗМО-16', '1', '4'), ('ЗО-10', '1', '4'), ('ЗОС-11', '1', '4'), ('ЗД-13', '1', '4'), ('ЗАТ-13', '1', '4'), 
	('ЗСДМ-13', '1', '4'), ('ЗНТС-13', '1', '4'), ('ЗПГС-15', '1', '4'), ('ЗДА-15', '1', '4'), ('ЗИС-17', '1', '4'), ('ЗИС-17а', '1', '4'), ('ЗЭ-18', '1', '4'), ('ЗМП-18', '1', '4'), ('ЗУК-19', '1', '4'), 
	('ЗМ-22', '2', '4'), ('ЗМСП-22', '2', '4'), ('ЗТМ-22', '2', '4'), ('ЗА-24', '2', '4'), ('ЗМО-26', '2', '4'), ('ЗО-20', '2', '4'), ('ЗОС-21', '2', '4'), ('ЗД-23', '2', '4'), ('ЗАТ-23', '2', '4'), 
	('ЗСДМ-23', '2', '4'), ('ЗНТС-23', '2', '4'), ('ЗПГС-25', '2', '4'), ('ЗДА-25', '2', '4'), ('ЗИС-27', '2', '4'), ('ЗИС-27а', '2', '4'), ('ЗЭ-28', '2', '4'), ('ЗМП-28', '2', '4'), ('ЗУК-29', '2', '4');


INSERT INTO lecturer(surname, name, middle_name) VALUES
	('Александрова', 'Екатерина', 'Викторовна'),
	('Бахаева', 'Дарья', 'Дмитриевна'),
	('Бойков', 'Сергей', 'Юрьевич'),
	('Горовой', 'Юрий', 'Михайлович'),
	('Ермишин', 'Александр', 'Сергеевич'),
	('Кочерова', 'Вера', 'Владимировна'),
	('Кузин', 'Артем', 'Викторович'),
	('Маевский', 'Вячеслав', 'Константинович'),
	('Никитенко', 'Андрей', 'Владимирович'),
	('Раухваргер', 'Алексей', 'Борисович'),
	('Царев', 'Юрий', 'Валерьевич'),
	('Царева', 'Софья', 'Александровна'),
	('Шастина', 'Екатерина', 'Михайловна'),
	('Близнюк', 'Ольга', 'Николаевна');
	

INSERT INTO subject(subject_name) VALUES
	('Культурология'),
	('Психология управления коллективом'),
	('Физика'),
	('Химия'),
	('Философия'),
	('Математика'),
	('Иностранный язык'),
	('Физическая культура'),
	('История'),
	('Инженерная и компьютерная графика'),
	('Программирование и основы алгоритмизации'),
	('Информатика'),
	('Технологии программирования'),
	('Социология'),
	('Web - технологии'),
	('Культурология и этика общения'),
	('Инфокоммуникационные сети и системы'),
	('Операционные системы'),
	('Теория вероятности и математическая статистика'),
	('Дискретная математика'),
	('Архитектура информационных систем'),
	('Технические средства автоматизации и управления'),
	('Правоведение'),
	('Оптимальное управление'),
	('Инструментальные средства информационных систем'),
	('Инвестиционный менеджмент'),
	('Типовые автоматические системы регулирования'),
	('Управление качеством'),
	('Защита интеллектуальной собственности'),
	('Корпоративные инф.сист.упр.предп.Современные ERP системы'),
	('Системы управления базами данных'),
	('Моделирование производствен.процессов');



--INSERT INTO shedule_time (day, task_time, fk_subject, fk_classroom, fk_lecturer) VALUES
--	('Понедельник', '1',  '1', '1', '1'),
--	('Понедельник', '2',  '2', '2', '2'),
--	('Понедельник', '3',  '3', '10', '3'),
--	('Понедельник', '4',  '4', '11', '4');

--INSERT INTO shedule_table (fk_group, shed_time, semester, year) VALUES
--	('1', '1',  '1', '2020/2021'),
--	('1', '2',  '1', '2020/2021'),
--	('2', '3',  '1', '2020/2021'),
--	('2', '4',  '1', '2020/2021');

